# Statistics

In [3]:
import pandas as pd

In [11]:
df= pd.read_excel(r"C:\Users\nikhi\Downloads\weather_data_XL.xlsx")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [13]:
df['Temperature_C'].max()

34

In [14]:
df['Temperature_C'].min()

28

In [15]:
df['Temperature_C'].std()

1.911950719959998

In [16]:
df['Temperature_C'].mean()

np.float64(30.9)

In [19]:
df.City[df.Temperature_C==df.Temperature_C.max()]

6    Banglore
Name: City, dtype: object

In [23]:
df[df.Temperature_C==df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore             34          61     Sunny

In [21]:
df.count()

Date             10
City             10
Temperature_C    10
Humidity_%       10
Condition        10
dtype: int64

In [22]:
df["City"].value_counts()

City
Hyderbad      4
Banglore      4
Vijayawada    2
Name: count, dtype: int64

# String Cleaning

In [24]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [26]:
df["City"]=df["City"].str.lower()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    hyderbad             28          60     Sunny
1 2025-01-02    hyderbad             29          62     Sunny
2 2025-01-03    hyderbad             30          58    Cloudy
3 2025-01-04    hyderbad             31          55    Cloudy
4 2025-01-05    banglore             32          57     Rainy
5 2025-01-06    banglore             33          59     Rainy
6 2025-01-07    banglore             34          61     Sunny
7 2025-01-08    banglore             32          63    Cloudy
8 2025-01-09  vijayawada             31          64     Rainy
9 2025-01-10  vijayawada             29          62     Sunny

In [27]:
df["City"]=df["City"].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

In [28]:
df["City"]=df["City"].str.replace("HYDERBAD","CHENNAI")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI             28          60     Sunny
1 2025-01-02     CHENNAI             29          62     Sunny
2 2025-01-03     CHENNAI             30          58    Cloudy
3 2025-01-04     CHENNAI             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

# Concate DataFrames

In [29]:
india_weather = pd.DataFrame({
    "city":["mumbai","banglore","Hyderbad"],
    "Temperature":[32,45,35]
})
india_weather

       city  Temperature
0    mumbai           32
1  banglore           45
2  Hyderbad           35

In [30]:
US_weather=pd.DataFrame({
    "city":["New york","chicago","orlando"],
    "Temperature":[32,45,35]
})
US_weather

       city  Temperature
0  New york           32
1   chicago           45
2   orlando           35

In [32]:
df=pd.concat([india_weather,US_weather],ignore_index=True)
df

       city  Temperature
0    mumbai           32
1  banglore           45
2  Hyderbad           35
3  New york           32
4   chicago           45
5   orlando           35

In [33]:
df=pd.concat([india_weather,US_weather],axis=1)
df

       city  Temperature      city  Temperature
0    mumbai           32  New york           32
1  banglore           45   chicago           45
2  Hyderbad           35   orlando           35

# Merge DataFrames

In [4]:
temp_df=pd.DataFrame({
    "city":["hyderabad","Vijayawada","Viskhapatnam","Chennai"],
    "temperature":[32,45,30,35]
})
temp_df

           city  temperature
0     hyderabad           32
1    Vijayawada           45
2  Viskhapatnam           30
3       Chennai           35

In [5]:
humidity_df=pd.DataFrame({
    "city":["hyderabad","Vijayawada","Viskhapatnam","banglore"],
    "humidity":[62,65,60,75]
})
humidity_df

           city  humidity
0     hyderabad        62
1    Vijayawada        65
2  Viskhapatnam        60
3      banglore        75

In [6]:
df=pd.merge(temp_df,humidity_df,on="city")
df

           city  temperature  humidity
0     hyderabad           32        62
1    Vijayawada           45        65
2  Viskhapatnam           30        60

In [7]:
df=pd.merge(temp_df,humidity_df,on="city",how="outer")
df

           city  temperature  humidity
0       Chennai         35.0       NaN
1    Vijayawada         45.0      65.0
2  Viskhapatnam         30.0      60.0
3      banglore          NaN      75.0
4     hyderabad         32.0      62.0

In [8]:
df.isnull()#to find null values / missing values

    city  temperature  humidity
0  False        False      True
1  False        False     False
2  False        False     False
3  False         True     False
4  False        False     False

In [9]:
df.isnull().sum()

city           0
temperature    1
humidity       1
dtype: int64

In [10]:
df

           city  temperature  humidity
0       Chennai         35.0       NaN
1    Vijayawada         45.0      65.0
2  Viskhapatnam         30.0      60.0
3      banglore          NaN      75.0
4     hyderabad         32.0      62.0

In [12]:
df["temperature"]=df["temperature"].fillna(30)

In [13]:
df

           city  temperature  humidity
0       Chennai         35.0       NaN
1    Vijayawada         45.0      65.0
2  Viskhapatnam         30.0      60.0
3      banglore         30.0      75.0
4     hyderabad         32.0      62.0

In [20]:
df["humidity"]=df["humidity"].fillna(df.temperature.min())

In [21]:
df.isnull()

    city  temperature  humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False     False

In [22]:
df

           city  temperature  humidity
0       Chennai         35.0      30.0
1    Vijayawada         45.0      65.0
2  Viskhapatnam         30.0      60.0
3      banglore         30.0      75.0
4     hyderabad         32.0      62.0